Encoding using sklearn

In [ ]:
df = pd.DataFrame({'Marks' : ['78','30','50','92',"80","66"],
                   'Grade' : ['C','F','D','A','B','C']})
df

  Marks Grade
0    78     C
1    30     F
2    50     D
3    92     A
4    80     B
5    66     C

A=0
B=1
C=2
D=3
F=4

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Grade'] = le.fit_transform(df['Grade'])  
df

  Marks  Grade
0    78      2
1    30      4
2    50      3
3    92      0
4    80      1
5    66      2

ONE HOT ENCODING

In [ ]:
import pandas as pd
df = pd.DataFrame({'Image' : ['Image 1','Image 2','Image 3','Image 4',"Image 5","image 6"],
                   'category' : ['cat','dog','cat','human','human','cat']})
df

     Image category
0  Image 1      cat
1  Image 2      dog
2  Image 3      cat
3  Image 4    human
4  Image 5    human
5  image 6      cat

In [ ]:
new_df = pd.get_dummies(df,columns=['category'])

In [ ]:
new_df

     Image  category_cat  category_dog  category_human
0  Image 1             1             0               0
1  Image 2             0             1               0
2  Image 3             1             0               0
3  Image 4             0             0               1
4  Image 5             0             0               1
5  image 6             1             0               0

In [ ]:
import numpy as np
df = pd.DataFrame({'Image' : ['Image 1','Image 2','Image 3','Image 4',"Image 5","image 6"],
                   'category' : ['cat','dog','cat','human','human',np.nan]})
df

     Image category
0  Image 1      cat
1  Image 2      dog
2  Image 3      cat
3  Image 4    human
4  Image 5    human
5  image 6      NaN

pd.get_dummies() method ignore the NaN value while encoding.

In [ ]:
new_df = pd.get_dummies(df,columns=['category'])
new_df

     Image  category_cat  category_dog  category_human
0  Image 1             1             0               0
1  Image 2             0             1               0
2  Image 3             1             0               0
3  Image 4             0             0               1
4  Image 5             0             0               1
5  image 6             0             0               0

to consider the NaN value, use parameter dummy_na = True.

In [ ]:
new_df = pd.get_dummies(df,columns=['category'],dummy_na=True)   # use dummy_na = True
new_df

     Image  category_cat  category_dog  category_human  category_nan
0  Image 1             1             0               0             0
1  Image 2             0             1               0             0
2  Image 3             1             0               0             0
3  Image 4             0             0               1             0
4  Image 5             0             0               1             0
5  image 6             0             0               0             1